
&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьПоследовательностьС();
КонецПроцедуры



&НаСервере
Процедура ВосстановитьПоследовательностьС()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Док.Ссылка,
	//|	Док.Дата КАК Период,
	//|	Док.Валюта,
	//|	Док.Проведен
	//|ИЗ
	//|	Документ.ПоступлениеСредств КАК Док
	//|ГДЕ
	//|	Док.Валюта <> &ВалютаРегл И Док.Дата Между &ДатаНач И &ДатаКон";

	//Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	//Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	//Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);

	//Результат = Запрос.Выполнить();

	//Выборка = Результат.Выбрать();

	//
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если НЕ Последовательности.ПартииВалюты.Принадлежит(Выборка.Ссылка) Тогда
	//		НаборЗаписей = Последовательности.ПартииВалюты.СоздатьНаборЗаписей();
	//		НаборЗаписей.Отбор.Регистратор.Установить(ВЫборка.Ссылка);
	//		Если Выборка.Проведен Тогда //если не проведен, а запись в послед-ти есть, то она удалится
	//			НовСтр = НаборЗаписей.Добавить();
	//			НовСтр.Валюта = Выборка.Валюта;
	//			НовСтр.Период = Выборка.Период;
	//			НовСтр.Регистратор = Выборка.Ссылка;
	//		КонецЕсли;
	//		НаборЗаписей.Записать();
	//	КонецЕсли;
	//КонецЦикла;
	
		
	МоментВосстПо = Новый МоментВремени(КонецДня(ДатаКон));
	Если ЗначениеЗаполнено(Валюта) Тогда
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Валюта");
		НовСтр = ТЗ.Добавить();
		НовСтр.Валюта = Валюта;
		Последовательности.ПартииВалюты.Восстановить(МоментВосстПо, ТЗ);
	Иначе
		Последовательности.ПартииВалюты.Восстановить(МоментВосстПо);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(Валюта) Тогда
	//	
	//	ТЗ = Новый Структура("Валюта", Валюта);
	//	Элементы.Декорация1.Заголовок = Последовательности.ПартииВалюты.ПолучитьГраницу(ТЗ);
	//Иначе
	//	Элементы.Декорация1.Заголовок = Последовательности.ПартииВалюты.ПолучитьГраницу();
	//КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьГраницуПоследовательности(Валюта)
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		
		ТЗ = Новый Структура("Валюта", Валюта);
		Возврат Последовательности.ПартииВалюты.ПолучитьГраницу(ТЗ);
	Иначе
		Возврат Последовательности.ПартииВалюты.ПолучитьГраницу();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьГраницуПоследовательности(Валюта)
	Гр = ПолучитьГраницуПоследовательности(Валюта);
	
	Элементы.Декорация1.Заголовок = Гр;
	
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьГраницуПоследовательности(Валюта);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ПоказатьГраницуПоследовательности(Валюта);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорм(Команда)
	ПоказатьГраницуПоследовательности(Валюта);
КонецПроцедуры


