//на форме есть 6 групп, каждая отображает неделю.
//в группе создаются кнопки по датам месяца - программно, процедурой СоздатьКнопки().
//переменная ТекМесяц содержит дату начала месяца.
//команды Вперед и Назад двигают дату на месяц вперед и назад.
//при открытии формы срабатывает процедура ПриСозданииНаСервере(), из которой 
//устанавливается текущая дата месяца и вызывается процедура создания кнопок.
//перед созданием кнопок нужно найти бюджет за этот месяц, чтобы из него
//читать данные для кнопок

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекМесяц = НачалоМесяца(ТекущаяДата());
	СоздатьКнопкиС()
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	ТекМесяц = КонецМесяца(ТекМесяц)+1;
	СоздатьКнопки()
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ТекМесяц = НачалоМесяца(ТекМесяц-1);
	СоздатьКнопки()
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКнопки()
	СоздатьКнопкиС()
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкиС()
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	//прочитать бюджет за текущий месяц
	ДеревоБДРФорма = ПрочитатьБюджет();
		
	//создание кнопок
	
	УдалитьКнопкиС();
	
	//Определить количество недель в тек месяце
	КолНедель = 0;
	сч = ТекМесяц;
	Пока сч <= КонецМесяца(ТекМесяц) Цикл
		Если ДеньНедели(сч) = 7 Тогда
			КолНедель = КолНедель + 1;
		КонецЕсли;
		сч = сч + 86400;
	КонецЦикла;
	
	//последняя неделя может закончиться не в воскресенье, надо проверить
	//сч теперь равен началу след месяца, если это не понедельник, значит
	//месяц закончился не в воскр.
	Если ДеньНедели(сч) <> 1 Тогда
		КолНедель = КолНедель + 1;	
	КонецЕсли;
	
	НомерЗаглушки = 1;//имя для кнопок, которые не входят в этот месяц
	ТекДата = ТекМесяц;
	ДеньМесяца = 1;
	//создать кнопки в неделях
	Для сч = 1 По КолНедель Цикл
		Для ы = 1 по 7 Цикл
			
			Если ТекДата > КонецМесяца(ТекМесяц)  Тогда
				//это для следующего месяца
				
				//эта кнопка выводится без надписи, т.к. она не из текущего месяца
				Имя = "Заглушка"+строка(НомерЗаглушки);
				Заг = " ";
				НомерЗаглушки = НомерЗаглушки + 1;
				Родитель = ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ДеньНедели(ТекДата)  )];
				
				ДеньМесяца = ДеньМесяца + 1;
				ТекДата = ТекДата + 86400;
				
			ИначеЕсли сч = 1 и ДеньНедели(ТекДата) > ы Тогда
				//это сработает в первую неделю
				
				//эта кнопка выводится без надписи, т.к. она не из текущего месяца
				Имя = "Заглушка"+строка(НомерЗаглушки);
				Заг = " ";
				НомерЗаглушки = НомерЗаглушки + 1;
				Родитель = ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ы  )];
				
			Иначе
				
				//это для дат внутри месяца 
				
				Имя = "Неделя"+Строка(сч)+"День"+Строка(ДеньНедели(ТекДата));
								Родитель = ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ДеньНедели(ТекДата)  )];
				
				
				
				//формируем заголовок кнопки
				
				Заг = Строка(ДеньМесяца) + Символы.ПС;
				Заг = Заг + "Нач. ост "+Строка(ДеревоБДРФорма.Строки[0]["План"+Строка(ДеньМесяца)]) + Символы.ПС;
				Заг = Заг + "Приход   "+Строка(ДеревоБДРФорма.Строки[1]["План"+Строка(ДеньМесяца)]) + Символы.ПС;
				Заг = Заг + "Расход   "+Строка(ДеревоБДРФорма.Строки[2]["План"+Строка(ДеньМесяца)]) + Символы.ПС;
				Заг = Заг + "Кон. ост "+Строка(ДеревоБДРФорма.Строки[3]["План"+Строка(ДеньМесяца)]) ;
				
				

				ДеньМесяца = ДеньМесяца + 1;
				ТекДата = ТекДата + 86400;
				
				
			КонецЕсли;
			
			//Добавляем новую команду
			Кмд = ЭтаФорма.Команды.Добавить(Имя);
			Кмд.Действие = "НажатиеКнопки";
			Кмд.Заголовок = Заг;
			
			
		    //Добавляем новую кнопку
			
		    Элемент2 = ЭтаФорма.Элементы.Добавить(Имя, Тип("КнопкаФормы"),  Родитель);
		    Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		    Элемент2.ИмяКоманды = Имя;
			Элемент2.Ширина = 16;
			Элемент2.Высота = 5;
			Элемент2.Заголовок = Заг;
			
			Элемент2.Шрифт = Новый Шрифт(,10);
			
			Если ы = 6 или ы = 7 Тогда
				Элемент2.ЦветТекста = Новый Цвет(255,0,0);
			Иначе
				Элемент2.ЦветТекста = Новый Цвет(0,0,0);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты, );
	
КонецПроцедуры

//читает бюджет за текущий месяц и возвращает его дерево
&НаСервере
Функция ПрочитатьБюджет()
	
	//поиск бюджета
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетМесяц.Ссылка
		|ИЗ
		|	Документ.БюджетМесяц КАК БюджетМесяц
		|ГДЕ
		|	БюджетМесяц.Дата МЕЖДУ &ДатаНач И &ДатаКон";

	Запрос.УстановитьПараметр("ДатаНач", ТекМесяц);
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекМесяц));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    Бюджет = Неопределено;
	ГодовойБюджет = Неопределено;
	НачальныйОстаток = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Бюджет = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//создадим и заполним дерево бюджета
	
	ДеревоБДРФорма = Новый ДеревоЗначений;
	ДеревоБДРФорма.Колонки.Добавить("СтатьяДР");
	ДеревоБДРФорма.Колонки.Добавить("ПриходРасход");
	ДеревоБДРФорма.Колонки.Добавить("ЭтоГруппа");
	Для сч = 1 по 32 Цикл
		ДеревоБДРФорма.Колонки.Добавить("План"+сч);
		ДеревоБДРФорма.Колонки.Добавить("Факт"+сч);
	КонецЦикла;
	
	Документы.БюджетМесяц.ЗаполнитьСуществующийБюджет(Бюджет, ДеревоБДРФорма);
	
	Возврат ДеревоБДРФорма;
	
КонецФункции

&НаСервере
Процедура УдалитьКнопкиС()
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	Для сч = 1 По 6 Цикл
		Для ы = 1 по 7 Цикл
			Родитель = ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ы  )];
			
			Имя = "Неделя"+Строка(сч)+"День"+Строка(ы);
			
			Попытка 
				
				ЭтаФорма.Команды.Удалить(ЭтаФорма.Команды[Имя]);
				
			Исключение
			КонецПопытки;
			
			Попытка 
			
				ЭтаФорма.Элементы.Удалить(ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ы  )].ПодчиненныеЭлементы[0]);

			Исключение
			КонецПопытки;
						
		КонецЦикла;
	КонецЦикла;
	
	//Удалить заглушки
	
	сч = 1;
	Пока 0=0 Цикл
		
		Рез = ЭтаФорма.Команды.Найти("Заглушка"+строка(сч));
		Если Рез = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ЭтаФорма.Команды.Удалить(Рез);
		сч=сч+1;
	КонецЦикла;
	
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты, );
	
КонецПроцедуры


&НаКлиенте
Процедура НажатиеКнопки()
	ТекКнопка = ЭтаФорма.ТекущийЭлемент.Имя;
	Если Найти(ТекКнопка, "Заглушка")>0 Тогда
		Возврат;
	КонецЕсли;
	//остальные - не жирные
	Для сч = 1 По 6 Цикл
		Для ы = 1 по 7 Цикл
			//Родитель = ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ы  )];
			//Имя = "Неделя"+Строка(сч)+"День"+Строка(ы);
			Попытка 
				ЭтаФорма.Элементы["ГруппаНеделя"+Строка(сч)].ПодчиненныеЭлементы["ГруппаДень"+Строка(сч)+Строка(  ы  )].ПодчиненныеЭлементы[0].Шрифт = Новый Шрифт(,10,Ложь);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	//текущая кнопка стала жирной
	ЭтаФорма.ТекущийЭлемент.Шрифт = Новый Шрифт(,10,Истина);

КонецПроцедуры

