
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//регистр ДенежныеСредства 
	НаборЗаписей = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.ВидДвижения = ?(Сумма<0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	
	НоваяЗапись.Период = Дата;
	НоваяЗапись.Регистратор = Ссылка;
	НоваяЗапись.Кошелек = Кошелек;
	
	Если Не ЭтоПрогноз Тогда
		НоваяЗапись.СуммаРегл = Сумма*?(Сумма<0,-1,1);
	Иначе
		НоваяЗапись.СуммаПрогнозРегл = Сумма*?(Сумма<0,-1,1);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	//регистр БДР
	Если Бюджет Тогда
		Контрагент=Неопределено;
		Номенклатура=Неопределено;
		ОбщийМодуль1Сервер.ДвижениеБДРФакт(движения.бдр, СтатьяДР, Сумма*?(Сумма<0,-1,1), Дата, Номенклатура, Контрагент, Проект, ЭтоПрогноз);
	КонецЕсли;
	
	//регистр Сбережения
	
	Если ОтразитьВСбережениях Тогда
		НаборЗаписей = РегистрыНакопления.Сбережения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ВидДвижения = ?(Сумма<0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.Кошелек = Кошелек;
		
		Если Не ЭтоПрогноз Тогда
			НоваяЗапись.СуммаРегл = Сумма*?(Сумма<0,-1,1);
		Иначе
			//20 03 14 пока так, потому что ресурса для прогноза в регистре нет за ненадобностью, можеть быть потом добавлю
			//НоваяЗапись.СуммаПрогнозРегл = Сумма*?(Сумма<0,-1,1);
			НоваяЗапись.СуммаРегл = Сумма*?(Сумма<0,-1,1);
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
			КонецЕсли;
	
КонецПроцедуры
