
&НаКлиенте
Процедура УдалитьДокументы(Команда)
	Если Вопрос("Удалить все документы?", РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена)=КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	УдалитьДокументыСервер()
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыСервер()

	Для	Каждого Стр Из Метаданные.Документы Цикл
		
		Выборка = Документы[Стр.Имя].Выбрать();
		Пока Выборка.Следующий() Цикл
			Док = Выборка.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
