
&НаКлиенте
Процедура ВидКошелькаПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаСервере
Функция УправлениеВидимостьюСервер()
	
	РезультатСтруктура = Новый Структура;
	Если Объект.ВидКошелька = Перечисления.ВидыКошельков.Наличные Тогда
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Ложь);
		
	ИначеЕсли Объект.ВидКошелька = Перечисления.ВидыКошельков.БанковскийСчет Тогда
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Истина);

	ИначеЕсли Объект.ВидКошелька = Перечисления.ВидыКошельков.ЭлектронныеДеньги Тогда
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Ложь);

	Иначе
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Ложь);

	КонецЕсли;
	
	Возврат РезультатСтруктура;
	
КонецФункции

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	
	ВидимостьСтруктура = УправлениеВидимостьюСервер();
	
	Элементы.СтраницаБанкСчет.Видимость = ВидимостьСтруктура.СтраницаБанкСчет;
	
	Элементы.СтатьяКредитПолученный.Видимость = Объект.КредитнаяКарта;
	Элементы.НадписьСтатьяКредитПолуч.Видимость = Объект.КредитнаяКарта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура КредитнаяКартаПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозПоДепозиту(Команда)
	ПрогнозПоДепозитуСервер();
КонецПроцедуры

&НаСервере
Процедура ПрогнозПоДепозитуСервер()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Ставка", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("НачОст", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ПроцентыЗаДень", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ПроцентыВсего", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("КонОст", Новый ОписаниеТипов("Число"));
	
    СрокДепо = Объект.Срок;
	Коэффициент = 1;
	Если Объект.ЕдиницаСрока = 0 Тогда
		Коэффициент = 1 / 365 / 100;
	ИначеЕсли Объект.ЕдиницаСрока = 1 Тогда
		//месяцы
		Коэффициент = 1 / 12 / 100;
	ИначеЕсли Объект.ЕдиницаСрока = 2 Тогда
		//годы
		Коэффициент = 1 / 100;
	КонецЕсли;
	
	НовСтр = ТЗ.Добавить();
	НовСтр.Дата = Объект.ДатаОткрытия+86400;
	НовСтр.НачОст = Объект.НачОст;
	НовСтр.Ставка = Объект.Ставка * Коэффициент;
	НовСтр.ПроцентыЗаДень = НовСтр.НачОст*НовСтр.Ставка;
	НовСтр.ПроцентыВсего = НовСтр.ПроцентыВсего + НовСтр.ПроцентыЗаДень;
	НовСтр.КонОст = НовСтр.НачОст;
	
	Если КонецДня(НовСтр.Дата) = КонецМесяца(НовСтр.Дата) Тогда
		Если Объект.Капитализация Тогда
			НовСтр.КонОст = НовСтр.КонОст + НовСтр.ПроцентыВсего;
			НовСтр.ПроцентыВсего = 0;	
		КонецЕсли;
	КонецЕсли;

	
	Для сч = 1 По СрокДепо-1 Цикл
		НовСтр 					= ТЗ.Добавить();
		НовСтр.Дата				= ТЗ.Получить(сч-1)["Дата"]+86400;
		НовСтр.НачОст 			= ТЗ.Получить(сч-1)["КонОст"];
		НовСтр.Ставка 			= Объект.Ставка * Коэффициент;
		НовСтр.ПроцентыЗаДень 	= НовСтр.НачОст*НовСтр.Ставка;
		НовСтр.ПроцентыВсего 	= ТЗ.Получить(сч-1)["ПроцентыВсего"] + НовСтр.ПроцентыЗаДень;
		НовСтр.КонОст 			= НовСтр.НачОст;
		Если КонецДня(НовСтр.Дата) = КонецМесяца(НовСтр.Дата) Тогда
			Если Объект.Капитализация Тогда
				НовСтр.КонОст = НовСтр.КонОст + НовСтр.ПроцентыВсего;
				НовСтр.ПроцентыВсего = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТЗ.ВыбратьСтроку();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

КонецПроцедуры
