
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКопирование(Команда)
	ВыполнитьКопированиеС();
	//Сообщить("Копирование завершено!");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКопированиеС()
	
	ДатаДок = ПериодКопирования.ДатаНачала;
	
	//если режим = "раз в месяц", то надо выбирать число (день даты) исходного документа
	Если Периодичность = 8 Тогда //через месяц
		ДатаДок = Дата(Год(ДатаДок), Месяц(ДатаДок), День(ВыбДок.Дата));
	КонецЕсли;
	
	Пока ДатаДок <= ПериодКопирования.ДатаОкончания Цикл
		
		Если Периодичность = 9 Тогда //рабочая неделя
			
			Если ДеньНедели(ДатаДок) = 6 ИЛИ ДеньНедели(ДатаДок) = 7 Тогда
				ДатаДок = ДатаДок+86400;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Док = Документы[ВыбДок.Метаданные().Имя].СоздатьДокумент();
		
		
		ИсключаяСвойства = "Номер,Дата";
		ЗаполнитьЗначенияСвойств(Док, ВыбДок,,ИсключаяСвойства);
		Док.Дата = ДатаДок;
		Если ЗначениеЗаполнено(ВыбКошелек) Тогда
			Док.Кошелек = ВыбКошелек;
		КонецЕсли;
		
		//Для Каждого ТЧ Из Док.Метаданные
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		//добавим период к текущей дате
		Если Периодичность = 1 Тогда //каждый день
			ДатаДок = ДатаДок+86400;
		ИначеЕсли Периодичность = 2 Тогда //через день
			ДатаДок = ДатаДок+(86400*2);
			
		ИначеЕсли Периодичность = 3 Тогда //через 2 дня
			ДатаДок = ДатаДок+(86400*3);
		ИначеЕсли Периодичность = 4 Тогда //через 3 дня
			ДатаДок = ДатаДок+(86400*4);
		ИначеЕсли Периодичность = 5 Тогда //через 4 дня
			ДатаДок = ДатаДок+(86400*5);
		ИначеЕсли Периодичность = 6 Тогда //через 5 дней
			ДатаДок = ДатаДок+(86400*6);
		ИначеЕсли Периодичность = 7 Тогда //через неделю
			ДатаДок = ДатаДок + (86400*7);
			
		ИначеЕсли Периодичность = 8 Тогда //через месяц
			ДатаДок = ДобавитьМесяц(ДатаДок, 1);
			
		ИначеЕсли Периодичность = 9 Тогда //рабочая неделя
			ДатаДок = ДатаДок+86400;
			
		ИначеЕсли Периодичность = 10 Тогда //через 2 неделю
			ДатаДок = ДатаДок + (86400*14);
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью()
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.ДеньНедели.Видимость = Ложь;
	Элементы.ДатаВМесяце.Видимость = Ложь;

	Если Периодичность = 7 Тогда
		Элементы.ДеньНедели.Видимость = Истина;
		Элементы.ДатаВМесяце.Видимость = Ложь;
	ИначеЕсли Периодичность = 8 Тогда
		Элементы.ДеньНедели.Видимость = Ложь;
		Элементы.ДатаВМесяце.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
