
&НаКлиенте
Процедура УстановитьВалюту(Команда)
	УстановитьВалютуСервер();
КонецПроцедуры


&НаСервере
Процедура УстановитьВалютуСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка
		|ИЗ
		|	Документ.ПеремещениеСредств КАК Док";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если Не ЗначениеЗаполнено(ДокОбъект.Валюта) Тогда
			ДокОбъект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокОбъект.Валюта, ДокОбъект.Дата);
			ДокОбъект.Курс = Курс.Курс;
			ДокОбъект.Кратность = Курс.Кратность;
			РежимЗаписиПроведения = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			ДокОбъект.Записать(РежимЗаписиПроведения);
			Сообщить("Обработан документ "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка
		|ИЗ
		|	Документ.ПоступлениеСредств КАК Док";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если Не ЗначениеЗаполнено(ДокОбъект.Валюта) Тогда
			ДокОбъект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокОбъект.Валюта, ДокОбъект.Дата);
			ДокОбъект.Курс = Курс.Курс;
			ДокОбъект.Кратность = Курс.Кратность;
			РежимЗаписиПроведения = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			ДокОбъект.Записать(РежимЗаписиПроведения);
			Сообщить("Обработан документ "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
		КонецЕсли;
	КонецЦикла;
	


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка
		|ИЗ
		|	Документ.РасходСредств КАК Док";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если Не ЗначениеЗаполнено(ДокОбъект.Валюта) Тогда
			ДокОбъект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокОбъект.Валюта, ДокОбъект.Дата);
			ДокОбъект.Курс = Курс.Курс;
			ДокОбъект.Кратность = Курс.Кратность;
			РежимЗаписиПроведения = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			ДокОбъект.Записать(РежимЗаписиПроведения);
			Сообщить("Обработан документ "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры


