
&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ПараметрыФормы = Новый Структура("ВидДвижения", ПолучитьВидДвижения());
	ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ФормаВыбораШаблона", ПараметрыФормы);
	Рез = ФормаВыбора.ОткрытьМодально();
	Если Рез<>Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.РасходСредств.Форма.ФормаДокумента");
		ДанныеФормы = Форма.Объект;
		ЗаполнитьДокументНаСервере(ДанныеФормы, Рез.Кошелек, Рез.СтатьяДР, Рез.Сумма);
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
		Форма.Открыть();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДокументНаСервере(ДанныеФормы, Кошелек, СтатьяДР, Сумма)
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.РасходСредств"));
	// Заполняем реквизиты какие нужно
	// Док.Реквизит = "ххх";
	// ......
	Док.Кошелек = Кошелек;
	Док.СтатьяДР = СтатьяДР;
	Док.Сумма = Сумма;
	Док.Валюта = Кошелек.Валюта;
	Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Док.Валюта, Док.Дата);
	Док.Курс = Курс.Курс;
	Док.Кратность = Курс.Кратность;

	ЗначениеВДанныеФормы(Док, ДанныеФормы);
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьВидДвижения()
	Возврат Перечисления.ВидыДвижений.Расход;
КонецФункции


&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	 ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры


&НаКлиенте
Процедура ГруппироватьПоПериодичности(Команда)
	ГруппироватьПоПериодичностиС();
КонецПроцедуры

&НаСервере
Процедура ГруппироватьПоПериодичностиС()
	
	ПолеПериодичность = Новый ПолеКомпоновкиДанных("Ссылка.СтатьяДР.Периодичность");
	Список.Группировка.Элементы.Очистить();
	//Нашли = Ложь;
	//Для Каждого Эл Из Список.Группировка.Элементы Цикл
	//	Если Эл.Поле = ПолеПериодичность Тогда
	//		ЭлементОтбора = Эл;
	//		Нашли = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//Если НЕ Нашли Тогда
		ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Поле = ПолеПериодичность;
	//КонецЕсли;

	
	Если Элементы.ФормаГруппироватьПоПериодичности.Пометка = Ложь Тогда
		ЭлементГруппировки.Использование = Истина;
		Элементы.ФормаГруппироватьПоПериодичности.Пометка = Истина;
	Иначе
		ЭлементГруппировки.Использование = Ложь;
		Элементы.ФормаГруппироватьПоПериодичности.Пометка = Ложь;
	КонецЕсли;
КонецПроцедуры
