
Процедура ПечатьДереваРекурсивно(СтрокиДерева, СекцияСтрока, ТабДок, СекцияСтрокаВерт)
	
	Для Каждого Стр Из СтрокиДерева Цикл
		СекцияСтрока.Параметры.СтатьяДР = Стр.СтатьяДР;
		Если Стр.ЭтоГруппа Тогда
			СекцияСтрока.ТекущаяОбласть.Шрифт = Новый Шрифт(,,Истина);
		Иначе	
			СекцияСтрока.ТекущаяОбласть.Шрифт = Новый Шрифт(,,Ложь);
		КонецЕсли;	
		ТабДок.Вывести(СекцияСтрока, Стр.Уровень());
		
		Для сч = 1 по 13 Цикл
			СекцияСтрокаВерт.Параметры.ПечПлан = Стр["План"+Строка(сч)];
			СекцияСтрокаВерт.Параметры.ПечФакт = Стр["Факт"+Строка(сч)];
			СекцияСтрокаВерт.Параметры.ПечВып = Стр["Рез"+Строка(сч)];
			
			ТабДок.Присоединить(СекцияСтрокаВерт);
		КонецЦикла;
		
		ПечатьДереваРекурсивно(Стр.Строки, СекцияСтрока, ТабДок, СекцияСтрокаВерт)
		
	КонецЦикла;
	
КонецПроцедуры

//вызывается из модуля формы документа (из серверной процедуры)
Процедура ПечатьБДРМоя(ТабДок, ПараметрКоманды) Экспорт

	Макет = Документы.БюджетГод.ПолучитьМакет("БДР");
	Ссылка = ПараметрКоманды.Ссылка;

	ДеревоБДРФорма = ОбщийМодуль1Сервер.СоздатьДеревоБДР();
	
	СтруктураПараметров = Новый Структура("ДеревоБДРФорма, Объект, НачальныйОстатокПлан, НачальныйОстатокФакт",
	ДеревоБДРФорма, Ссылка, Ссылка.НачальныйОстаток, Ссылка.НачальныйОстаток);
	
	ОбщийМодуль1Сервер.ЗаполнитьДеревоИзСправочникаСервер(СтруктураПараметров);
	
	//ОбщийМодуль1Сервер.ЗаполнитьДеревоБДРПриОткрытииСуществующегоДокументаСервер(Ссылка, ДеревоБДРФорма, Истина);
	
	//здесь у нас есть полностью заполненное и рассчитанное дерево
	
	Шапка = Макет.ПолучитьОбласть("Шапка|Начало");
	Шапка.Параметры.Заполнить(Ссылка);
	Загол = Макет.ПолучитьОбласть("Загол|Начало");
	СекцияСтрока = Макет.ПолучитьОбласть("Строка|Начало");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	//Шапка.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Шапка);
	
	ТабДок.Вывести(Загол);
	
	ЗаголВерт = Макет.ПолучитьОбласть("Загол|Верт");
	Для сч = 1 по 12 Цикл
		ЗаголВерт.Параметры.Мес = ОбщийМодуль1Сервер.ИмяМесяцаПоНомеру(сч);
		ТабДок.Присоединить(ЗаголВерт);
	КонецЦикла;
	//итоги
	ЗаголВерт.Параметры.Мес = "ИТОГО";
	ТабДок.Присоединить(ЗаголВерт);
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ТабДок.НачатьАвтогруппировкуСтрок ();
	
	СтрокаВерт = Макет.ПолучитьОбласть("Строка|Верт");
	ПечатьДереваРекурсивно(ДеревоБДРФорма.Строки, СекцияСтрока, ТабДок, СтрокаВерт);
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок ();
	
КонецПроцедуры

