

&НаКлиенте
Процедура ОтразитьВНакопленияхПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()

	Элементы.Группа3.Видимость = Объект.ГашениеКредита;
	Элементы.ГашениеКредита.Видимость = Объект.ГашениеКредита;
	Элементы.СтатьяДРГашение.Видимость = Объект.ГашениеКредита;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуЗапретаРедактирования()

	Возврат Константы.ДатаЗапретаРедактирования.Получить();

КонецФункции // ПолучитьДатуЗапретаРедактирования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
	Если НачалоДня(Объект.Дата)<=ПолучитьДатуЗапретаРедактирования() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта = ПолучитьВалютуРеглУчетаСервер();
		ВалютаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	//Если НЕ ЗначениеЗаполнено(Объект.Курс) Тогда
		Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
		Объект.Курс = Курс.Курс;
		Объект.Кратность = Курс.Кратность;
	//КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуРеглУчетаСервер()
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
КонецФункции
                                       
&НаКлиенте
Процедура ОтразитьВКредитахПриИзменении(Элемент)
	Если НЕ Объект.ОтразитьВКредитах Тогда
		Объект.СтатьяДРГашение = "";
		Объект.ГашениеКредита = Ложь;
	КонецЕсли;
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДРПриИзменении(Элемент)
	//выбрать контрагента
	ИзменитьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКонтрагента()
	//выбрать контрагента
	ИзменитьКонтрагентаС();
КонецПроцедуры

&НаСервере
Процедура ИзменитьКонтрагентаС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыПоСтатьямСрезПоследних.Контрагент
		|ИЗ
		|	РегистрСведений.КонтрагентыПоСтатьям.СрезПоследних(&Период, СтатьяДР = &СтатьяДР) КАК КонтрагентыПоСтатьямСрезПоследних";

	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СтатьяДР", Объект.СтатьяДР);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Прервать;
	КонецЦикла;

КонецПроцедуры
