
&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ПараметрыФормы = Новый Структура("ВидДвижения", ПолучитьВидДвижения());
	ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ФормаВыбораШаблона", ПараметрыФормы);
	Рез = ФормаВыбора.ОткрытьМодально();
	Если Рез<>Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.ПоступлениеСредств.Форма.ФормаДокумента");
		ДанныеФормы = Форма.Объект;
		ЗаполнитьДокументНаСервере(ДанныеФормы, Рез.Кошелек, Рез.СтатьяДР, Рез.ВидОперации, Рез.Сумма);
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
		Форма.Открыть();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДокументНаСервере(ДанныеФормы, Кошелек, СтатьяДР, ВидОперации, Сумма)
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПоступлениеСредств"));
	// Заполняем реквизиты какие нужно
	// Док.Реквизит = "ххх";
	// ......
	Док.Кошелек = Кошелек;
	Док.СтатьяДР = СтатьяДР;
	
	Док.ВидОперации = ВидОперации;
	Док.Сумма = Сумма;
	Док.Валюта = Кошелек.Валюта;
	Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Док.Валюта, Док.Дата);
	Док.Курс = Курс.Курс;
	Док.Кратность = Курс.Кратность;

	ЗначениеВДанныеФормы(Док, ДанныеФормы);
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьВидДвижения()
	Возврат Перечисления.ВидыДвижений.Приход;
КонецФункции


&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	 ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

