&НаСервере
Процедура ЗаполнитьС(Дата, ДокОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.Кошелек,
		|	Рег.Кошелек.Валюта КАК Валюта,
		|	ИСТИНА КАК Вкл,
		|	Рег.СуммаОстаток КАК ОстатокВал,
		|	Рег.СуммаРеглОстаток КАК ОстатокРегл,
		|	Рег.Кошелек.РасчетОстатковБюджет КАК Бюджет
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата, Кошелек.Валюта <> &Руб) КАК Рег";

	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Руб", Константы.ВалютаРегламентированногоУчета.Получить());

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	ДокОбъект.ТабличнаяЧасть1.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр = ДокОбъект.ТабличнаяЧасть1.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, выборка);
		
		//НовСтр.КурсВчера = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, Дата-86400).Курс;
		НовСтр.КурсСегодня = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Курс;
		
		НовСтр.Переоценка = НовСтр.КурсСегодня * НовСтр.ОстатокВал - НовСтр.ОстатокРегл;
		
		
		
		Если Новстр.бюджет Тогда
			
			Если НовСтр.Переоценка>0 Тогда
				НовСтр.СтатьяДР = Справочники.СтатьиДоходовРасходов.НайтиПоКоду("000000506");
			ИначеЕсли НовСтр.Переоценка<0 Тогда
				НовСтр.СтатьяДР = Справочники.СтатьиДоходовРасходов.НайтиПоКоду("000000412");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры