
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Переоценка.Ссылка
		|ИЗ
		|	Документ.Переоценка КАК Переоценка
		|ГДЕ
		|	Переоценка.Дата между &ДатаНач И &ДатаКон
		|	И Переоценка.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("ДатаНач", Началодня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", Конецдня(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		возврат;
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Бюджет = РегистрыНакопления.БДР.СоздатьНаборЗаписей();
	Бюджет.Отбор.Регистратор.Установить(Ссылка);
	
	Для Каждого Стр Из ТабличнаяЧасть1 Цикл
		Если Стр.Переоценка=0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.Период = Дата;
		НовСтр.Регистратор = Ссылка;
		НовСтр.Активность = Истина;
		
		НовСтр.ВидДвижения = ?(Стр.Переоценка>0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		
		НовСтр.Кошелек = стр.Кошелек;
		НовСтр.СуммаРегл = ?(Стр.Переоценка>0, Стр.Переоценка, -1*Стр.Переоценка);
		
		Если Стр.Бюджет Тогда
			НовСтрБ = Бюджет.Добавить();
			НовСтрБ.Активность = Истина;
			НовСтрБ.Период = Дата;
			НовСтрБ.СтатьяДоходовРасходов = Стр.СтатьяДР;
			НовСтрБ.СуммаФакт = ?(Стр.Переоценка>0, Стр.Переоценка, -1*Стр.Переоценка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Бюджет.Записать();
	
КонецПроцедуры

