
&НаКлиенте
Процедура ПереоценкаЗаПериод(Команда)
	
	Рез = ОткрытьФормуМодально(ПолучитьФорму("Документ.Переоценка.Форма.ФормаПериода"));
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПереоценкаЗаПериодС(Рез);
КонецПроцедуры

&НаСервере
Процедура ПереоценкаЗаПериодС(Период)
	
	Запрос = Новый Запрос("Выбрать ССылка из Документ.переоценка где Дата между &ДатаНач и &ДатаКон");
	
	
	
	сч = Период.ДатаНач;
	Пока сч<=Период.ДатаКон Цикл
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(сч));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(сч));
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Док = Документы.Переоценка.СоздатьДокумент();
			Док.Дата = сч;
		Иначе
			Док = Рез.Выгрузить()[0][0].ПолучитьОбъект();
		КонецЕсли;
		
		Документы.Переоценка.ЗаполнитьС(Док.Дата, Док);
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		сч=сч+86400;
	КонецЦикла;
КонецПроцедуры
