#Если Сервер Тогда
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтатьяДР = Параметры.СтатьяДР;
	Детализация = Параметры.Детализация;
	Период = Параметры.Период;
	Сумма = Параметры.Сумма;
	
	ЭтаФорма.Элементы.декСтатьяДР.Заголовок = Строка(СтатьяДР);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СтатьяДР", СтатьяДР);
	ПараметрыОтбора.Вставить("Период", Период);
	НайденныеСтроки = Детализация.НайтиСтроки(ПараметрыОтбора);

	ТабДеталФорма = ДанныеФормыВЗначение(ТабДетал,Тип("ТаблицаЗначений"));	
	
	Для Каждого Стр из НайденныеСтроки Цикл
		НовСтр = ТабДеталФорма.Добавить();
		НовСтр.Комментарий = Стр.Комментарий;
		НовСтр.Сумма = Стр.Сумма;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ТабДеталФорма, ТабДетал);
	
	ВремИтогПодвал=ТабДетал.Итог("Сумма");
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда

&НаКлиенте
Процедура Сохранить(Команда)
	ЭтаФорма.Закрыть(ТабДетал);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезСохранения(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТабДеталиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования Тогда
		ВремИтогПодвал=ТабДетал.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДеталиПослеУдаления(Элемент)
	ВремИтогПодвал=ТабДетал.Итог("Сумма");
КонецПроцедуры

#КонецЕсли
