///////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙСНАЯ ЧАСТЬ ПЕРЕОПРЕДЕЛЯЕМОГО МОДУЛЯ

// Вызывается при нажатии на гиперссылку или двойном щелчке на ячейке 
// табличного документа с описанием изменений системы.
//
// Параметры:
//   Область - ОбластьЯчеекТабличногоДокумента - область документа, на 
//             которой произошло нажатие.
//
// См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриНажатииНаГиперссылкуВДокументеОписанияОбновлений(Знач Область) Экспорт
	
	// _Демо начало примера
	Если Область.Имя = "_ДемоПримерГиперссылки" Тогда
		Предупреждение(НСтр("ru = 'Нажата гиперссылка!'"));
	КонецЕсли;
	
	
	//// УправлениеДоступом
	//Если Область.Имя = "_ДемоОбновитьДанныеОграниченияДоступа" Тогда
	//	Если УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() Тогда
	//		ОткрытьФормуМодально("Справочник.ГруппыДоступа.Форма.ОбновлениеДанныхОграниченияДоступа");
	//	Иначе
	//		Предупреждение(НСтр("ru = 'Ограничение доступа на уровне записей не используется!'"));
	//	КонецЕсли;
	//КонецЕсли;
	// Конец УправлениеДоступом
	
	// _Демо конец примера
	
КонецПроцедуры
