
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	Ссылка = ПараметрКоманды;
	ПараметрКоманды = Новый Структура("Ссылка",Ссылка); 
	ПечатьРезюме(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();

КонецПроцедуры


&НаСервере
Процедура ПечатьРезюме(ТабДок, ПараметрКоманды)
	Справочники.Резюме.ПечатьРезюме(ТабДок, ПараметрКоманды);
КонецПроцедуры
