
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Шаблоны.Ссылка,
		|	Шаблоны.Кошелек,
		|	Шаблоны.СтатьяДР,
		|	Шаблоны.ВидОперации,
		|	Шаблоны.ВидДвижения
		|ИЗ
		|	Справочник.Шаблоны КАК Шаблоны";

	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВДанныеФормы(Результат, Шаблоны);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекстВ = "Создать документ по шаблону?";
	Если Вопрос(ТекстВ,РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Ок) = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Стр = Элемент.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ВидДок = Неопределено;
	
	Если Стр.ВидДвижения = ПолучитьВидДвижения(0) Тогда
		ВидДок = "ПоступлениеСредств";
	ИначеЕсли Стр.ВидДвижения = ПолучитьВидДвижения(1) Тогда
		ВидДок = "РасходСредств";
	ИначеЕсли Стр.ВидДвижения = ПолучитьВидДвижения(2) Тогда
		ВидДок = "ПеремещениеСредств";
	КонецЕсли;
	
	Если ВидДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВидДвижения", Стр.ВидДвижения);
	Форма = ПолучитьФорму("Документ."+ВидДок+".Форма.ФормаДокумента");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьДокументНаСервере(ВидДок, ДанныеФормы, Стр.СтатьяДР, Стр.Кошелек, Стр.ВидОперации);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДокументНаСервере(ВидДок, ДанныеФормы, СтатьяДР, Кошелек, ВидОперации)
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект."+ВидДок));
	// Заполняем реквизиты какие нужно
	// Док.Реквизит = "ххх";
	// ......
	Если ВидДок = "ПеремещениеСредств" Тогда
		Док.Кошелек = Кошелек;
	Иначе
		Док.Кошелек = Кошелек;
	КонецЕсли;
	Если ВидДок = "ПеремещениеСредств" ИЛИ ВидДок = "ПоступлениеСредств" Тогда
		Док.ВидОперации = ВидОперации;
	КонецЕсли;
	Док.СтатьяДР = СтатьяДР;
	Док.Валюта = Кошелек.Валюта;
	Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Док.Валюта, Док.Дата);
	Док.Курс = Курс.Курс;
	Док.Кратность = Курс.Кратность;

	ЗначениеВДанныеФормы(Док, ДанныеФормы);
	
КонецФункции 


&НаСервереБезКонтекста
Функция ПолучитьВидДвижения(Вид=0)
	
	Если Вид = 0 Тогда
		Возврат Перечисления.ВидыДвижений.Приход;
	ИначеЕсли Вид = 1 Тогда
		Возврат Перечисления.ВидыДвижений.Расход;
	ИначеЕсли Вид = 2 Тогда
		Возврат Перечисления.ВидыДвижений.Перемещение;
	КонецЕсли;
КонецФункции 
