
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеНастроек.Пометка = Истина;
	Элементы.ГруппаНастройки.Видимость = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИнвертироватьВидимостьНастроек()
	Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеНастроек.Пометка = НЕ Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеНастроек.Пометка;
	Элементы.ГруппаНастройки.Видимость = НЕ Элементы.ГруппаНастройки.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеНастроек(Команда)
	ИнвертироватьВидимостьНастроек();
КонецПроцедуры
