
&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпцииБюджетов.Ссылка
		|ИЗ
		|	Справочник.ОпцииБюджетов КАК ОпцииБюджетов";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ОпцииСтатей.Добавить();
		НовСтр.Опция = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ОпцииСтатейВключенаПриИзменении(Элемент)
	ОпцииСтатейВключенаПриИзмененииС(Элементы.Список.ТекущиеДанные.Ссылка, Элементы.ОпцииСтатей.ТекущиеДанные.опция, Элементы.ОпцииСтатей.ТекущиеДанные.включена);
КонецПроцедуры

&НаСерверебезКонтекста
Процедура ОпцииСтатейВключенаПриИзмененииС(Статья, Опция, включена)
	
	если Статья.этогруппа тогда
		
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДоходовРасходов.Ссылка
		|ИЗ
		|	Справочник.СтатьиДоходовРасходов КАК СтатьиДоходовРасходов
		|ГДЕ
		|	СтатьиДоходовРасходов.Ссылка В ИЕРАРХИИ(&Ссылка)";

	Запрос.УстановитьПараметр("Ссылка", статья);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ОпцииСтатей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Опция.Установить(опция);
		НаборЗаписей.Отбор.Статьядр.Установить(ВыборкаДетальныеЗаписи.ссылка);
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.Опция= опция;
		новстр.СтатьяДР = ВыборкаДетальныеЗаписи.ссылка;
		новСтр.Включена = включена;
		НаборЗаписей.Записать();
		
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ОпцииСтатей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Опция.Установить(опция);
		НаборЗаписей.Отбор.Статьядр.Установить(Статья);
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.Опция= опция;
		новстр.СтатьяДР = статья;
		новСтр.Включена = включена;
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные<>Неопределено Тогда
		для Каждого стр из ОпцииСтатей цикл
			Стр.Включена = СписокПриАктивизацииСтрокиС(Элемент.ТекущиеДанные.Ссылка, Стр.Опция);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСерверебезКонтекста
Функция СписокПриАктивизацииСтрокиС(Статья, Опция)
	//заполнить флаг Включена. доделать - увести на сервер
	НаборЗаписей = РегистрыСведений.ОпцииСтатей.СоздатьНаборЗаписей();
	
		НаборЗаписей.Отбор.Опция.Установить(опция);
		НаборЗаписей.Отбор.СтатьяДР.Установить(Статья);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество()>0 Тогда
			Возврат НаборЗаписей[0].Включена;
		Иначе
			Возврат ЛОжь;
		КонецЕсли;
	    //записывать не надо
КонецФункции
