
&НаКлиенте
Процедура УправлениеВидимостьюКлиент()

		
	Элементы.СуммаКомиссии.Видимость = Объект.УчитыватьКомиссию;
	Элементы.СтатьяДРКомиссия.Видимость = Объект.УчитыватьКомиссию;

КонецПроцедуры // УправлениеВидимоситьюКлиент()

&НаСервереБезКонтекста
Функция ПолучитьДатуЗапретаРедактирования()

	Возврат Константы.ДатаЗапретаРедактирования.Получить();

КонецФункции // ПолучитьДатуЗапретаРедактирования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
	Если НачалоДня(Объект.Дата)<=ПолучитьДатуЗапретаРедактирования() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//07 09 16 зачем я так сделал? при копировании в новом документе по валютному кошельку проставляется валюта РУБ
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Объект.Валюта = ПолучитьВалютуРеглУчетаСервер();
	//	ВалютаПриИзменении(Неопределено);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВНакопленияхПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НакоплениеИлиВозвратПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьКомиссиюПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.Курс = Курс.Курс;
	Объект.Кратность = Курс.Кратность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуРеглУчетаСервер()
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
КонецФункции

&НаКлиенте
Процедура РазвернутьСтороны(Команда)
	К = Объект.Кошелек;
	Объект.Кошелек = Объект.КошелекПриемник;
	Объект.КошелекПриемник = К;
	Модифицированность = Истина;
КонецПроцедуры                

&НаКлиенте
Процедура КошелекИсточникПриИзменении(Элемент)
	Объект.Валюта = ОбщийМодуль1Сервер.ПолучитьВалютуКошелька(Объект.Кошелек);
	ВалютаПриИзменении(Неопределено);
КонецПроцедуры

