
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетС();
КонецПроцедуры


&НаСервере
Процедура СформироватьОтчетС()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.Кошелек.Банк КАК Банк,
		|	Рег.Кошелек КАК Кошелек,
		|	СУММА(Рег.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(Рег.СуммаРеглОстаток) КАК СуммаРеглОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаОтчета, ) КАК Рег
		|ГДЕ
		|	Рег.Кошелек.ТипКошелька = ЗНАЧЕНИЕ(Перечисление.ТипыКошельков.Депозит)
		|
		|СГРУППИРОВАТЬ ПО
		|	Рег.Кошелек.Банк,
		|	Рег.Кошелек
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рег.Кошелек.Банк.Наименование,
		|	Рег.Кошелек.Наименование
		|ИТОГИ
		|	СУММА(СуммаОстаток),
		|	СУММА(СуммаРеглОстаток)
		|ПО
		|	Банк,
		|	Кошелек";

	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));

	Результат = Запрос.Выполнить();

	ВыборкаБанк = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Об = РеквизитФормыВЗначение("Отчет");
	Макет = Об.ПолучитьМакет("Макет");
	
	ТабДок.Очистить();
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ДатаОтчета = Формат(ДатаОтчета, "ДФ=дд.ММ.гггг");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	
	ОбщийИтог = 0;
	Пока ВыборкаБанк.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("СтрокаБанк");
		Область.Параметры.Банк = ВыборкаБанк.Банк;
		ТабДок.Вывести(Область);
		//сразу запомним итоги по банку
		
		ТоталБанкРегл = ВыборкаБанк.СуммаРеглОстаток;
		
		сч=1;
		ВыборкаДепозит = ВыборкаБанк.Выбрать();
		Пока ВыборкаДепозит.Следующий() Цикл
			
			Если ВыборкаДепозит.ТипЗаписи() =  ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
				Продолжить;
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("СтрокаДепозит");
			
			Область.Параметры.НомерДепо 	= сч;
			сч=сч+1;
			Область.Параметры.Депозит 		= ВыборкаДепозит.Кошелек;
			Область.Параметры.Валюта 		= ВыборкаДепозит.Кошелек.Валюта;
			
			Попытка
				Область.Параметры.Курс 			= Окр(ВыборкаДепозит.СуммаРеглОстаток/ВыборкаДепозит.СуммаОстаток,2,1);
			Исключение
			КонецПопытки;
			
			Область.Параметры.СуммаВал 		= ВыборкаДепозит.СуммаОстаток;
			Область.Параметры.СуммаРуб 		= ВыборкаДепозит.СуммаРеглОстаток;
			Область.Параметры.Ставка 		= ВыборкаДепозит.Кошелек.Ставка;
			Область.Параметры.ДатаОткрытия 	= ВыборкаДепозит.Кошелек.ДатаОткрытия;
			Область.Параметры.Срок 			= ВыборкаДепозит.Кошелек.Срок;
			Область.Параметры.ДатаЗакрытия 	= ВыборкаДепозит.Кошелек.ДатаОткрытия+ВыборкаДепозит.Кошелек.Срок*86400;
			Область.Параметры.Капитализация = ВыборкаДепозит.Кошелек.Капитализация;
			Область.Параметры.ПополнятьДней = ВыборкаДепозит.Кошелек.ГраницаПополненияВДнях;
			Область.Параметры.ПополнятьДоДаты = Область.Параметры.ДатаЗакрытия - Область.Параметры.ПополнятьДней*86400;
			
			ТабДок.Вывести(Область);
			
		КонецЦикла;
		
		//итоги по банку выведем после строк с депозитами
		Область = Макет.ПолучитьОбласть("ТоталБанк");
		Область.Параметры.СуммаРуб = ТоталБанкРегл;
		ТабДок.Вывести(Область);
		
		ОбщийИтог = ОбщийИтог + ТоталБанкРегл;
		
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ТоталОбщий");
	Область.Параметры.СуммаРуб = ОбщийИтог;
	ТабДок.Вывести(Область);

	

	
КонецПроцедуры
