
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Имя", "Администратор");
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование = &Имя";
	РезультатПользователи = Запрос.Выполнить().Выбрать();	
	
	Если РезультатПользователи.Следующий() Тогда
		ПараметрыСеанса.ТекущийПользователь        = РезультатПользователи.Ссылка;
	Иначе
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование                = "Администратор";
		
		Попытка
			НовыйПользователь.Записать();
			ПараметрыСеанса.ТекущийПользователь        = НовыйПользователь.Ссылка;
		Исключение
			ПараметрыСеанса.ТекущийПользователь        = Справочники.Пользователи.ПустаяСсылка();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
