//не получается настроить сортировку статей по полю Порядок
//при попытке установить это поле для сортировки в настройках СКД
//оно говорит, что поле Порядок не найдено

&НаСервере
Функция РезультатОбработкаРасшифровкиСервер(Расшифровка)
	
	Перем ВыполненноеДействие;
	 
	ОтчетСервер = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.БюджетДоходовИРасходов"));
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОтчетСервер.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));
    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникДоступныхНастроек);
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	МассивПолей = Данные.Элементы[Расшифровка].ПолучитьПоля();
	ПолеРасшифровки = Новый ПолеКомпоновкиДанных(МассивПолей[0]);
	Настройки = ОбработкаРасшифровки.Расшифровать(Расшифровка, ПолеРасшифровки);
	
	Отбор = Новый Структура("Вариант, СтатьяДР, НачалоПериода, КонецПериода");
	
	Если Настройки = Неопределено Тогда
        Возврат Отбор;
	КонецЕсли;	
	
	Отбор.Вставить("Вариант", ОтчетСервер.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.найти("Вариант").Значение);
	Для Каждого Эл Из Настройки.Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатьяДР") Тогда
			Отбор.Вставить("СтатьяДР", Эл.ПравоеЗначение);
			
		ИначеЕсли Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Период") Тогда
			
			Если ТипЗнч(Эл.ПравоеЗначение) = Тип("Дата") Тогда
				Отбор.Вставить("НачалоПериода", НачалоМесяца(Эл.ПравоеЗначение));
				Отбор.Вставить("КонецПериода",  КонецМесяца (Эл.ПравоеЗначение));
			Иначе
				//выбрали колоку "СтатьяДР"
				Отбор.Вставить("НачалоПериода", НачалоГода(Эл.ПравоеЗначение.Дата));
				Отбор.Вставить("КонецПериода",  КонецГода (Эл.ПравоеЗначение.Дата));
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Отбор;
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Перем ВыполненноеДействие;

	СтандартнаяОбработка = Ложь;
	
	Отбор = РезультатОбработкаРасшифровкиСервер(Расшифровка);
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
	ПараметрыФормы.КлючНазначенияИспользования = "РасшифровкаСтатьиБюджета";
	ПараметрыФормы.КлючВарианта = "Основной";
	
	ПараметрыФормы.Отбор = Отбор;
	
	ОткрытьФорму("Отчет.ВедомостьПоСтатьямДР.Форма", ПараметрыФормы);
	
КонецПроцедуры

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ПолучитьГодВарианта(Вариант)

	Возврат Вариант.Год;

КонецФункции // ПолучитьГодВарианта()

&НаСервере
Функция СформироватьОтчетСервер(ТекстОшибки =  "", Вариант)
	
	Запрос = Новый Запрос;
	
	
	//сюда надо написать запрос, аналогичный отчету БюджетДДС	
	  
	  ТекстЗапроса =  "ВЫБРАТЬ
	                  |	БДРОбороты.СтатьяДоходовРасходов КАК СтатьяДР,
	                  |	БДРОбороты.СуммаПланОборот КАК План,
	                  |	БДРОбороты.Период КАК ПериодДДС
	                  |ИЗ
	                  |	РегистрНакопления.БДР.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК БДРОбороты";
	  
	 ВидКошелька = Новый СписокЗначений;
	Запрос.УстановитьПараметр("Бюджет", Вариант);
	//Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Вариант.Дата));
	//Запрос.УстановитьПараметр("КонецПериода",КонецГода (Вариант.Дата));			
	Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(НачалоГода(Вариант.Дата)-1));
	Запрос.УстановитьПараметр("КонецПериода",КонецГода (НачалоГода(НачалоГода(Вариант.Дата)-1)));			
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаБДР = РезультатЗапроса.Выгрузить();
	//ТаблицаБДР = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);//так нельзя, 1С падает
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаБДР", ТаблицаБДР);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Схема = Отчеты.БюджетДоходовИРасходов_ИстДанн_Объект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Отчет.КомпоновщикНастроек.Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	//убирает надпись "Отчет не сформирован"
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения  = ДополнительныйРежимОтображения.НеИспользовать;
	Элементы.Результат.ОтображениеСостояния.Видимость  = Ложь;
	
	Результат.Очистить();
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Результат.ПоказатьУровеньГруппировокСтрок(1);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОтчет(Команда)
	ТекстОшибки = "";
	Рез = СформироватьОтчетСервер(ТекстОшибки, Вариант);
	Если НЕ Рез Тогда
		Предупреждение(ТекстОшибки, 120);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	ВыполнитьОтчет(Неопределено)
КонецПроцедуры

