
//обновляет все бюджеты. фильтр на интервал дат пока не сделан
&НаКлиенте
Процедура ОбновитьВсеПоПрогнозу(Команда)
	Если Не Команда = Неопределено Тогда //если запуск программный, вопросов не задаем
		ТекстВопроса = "Обновить все бюджеты?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 60);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	ОбновитьВсеПоПрогнозуС();
КонецПроцедуры


&НаСервере
Процедура ОбновитьВсеПоПрогнозуС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БюджетМесяц.Ссылка,
	|	БюджетМесяц.ПредыдущийБюджет
	|ИЗ
	|	Документ.БюджетМесяц КАК БюджетМесяц
	|ГДЕ
	|	НЕ БюджетМесяц.ТолькоПросмотр
	|
	|УПОРЯДОЧИТЬ ПО
	|	БюджетМесяц.Дата";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ДокОб = Выборка.Ссылка.ПолучитьОбъект();
		
		ДокОб.НачальныйОстаток = Документы.БюджетМесяц.ПолучитьОстатокБюджета(Выборка.ПредыдущийБюджет);
		
	ДеревоБДРФорма = Новый ДеревоЗначений;
	ДеревоБДРФорма.Колонки.Добавить("СтатьяДР");
	ДеревоБДРФорма.Колонки.Добавить("ПриходРасход");
	ДеревоБДРФорма.Колонки.Добавить("ЭтоГруппа");
	Для сч = 1 по 32 Цикл
		ДеревоБДРФорма.Колонки.Добавить("План"+сч);
		ДеревоБДРФорма.Колонки.Добавить("Факт"+сч);
	КонецЦикла;
	
	Документы.БюджетМесяц.ЗаполнитьСуществующийБюджет(ДокОб, ДеревоБДРФорма);
	
	Документы.БюджетМесяц.ОчиститьПланСерверМенеджер(ДеревоБДРФорма);
	Документы.БюджетМесяц.ЗаполнитьПланПрогнозомСерверМенеджер(ДеревоБДРФорма, НачалоМесяца(ДокОб.Дата), "ПрогнозФакт", Истина);
	
		
		Документы.БюджетМесяц.СохранитьДеревоСерверМенеджер(ДеревоБДРФорма, ДокОб);
		ДокОб.Записать(РежимЗаписиДокумента.Запись);
		
		Документы.БюджетМесяц.СохранитьБюджетСМенеджер(ДеревоБДРФорма, ДокОб);
		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьГодовойБюджет(Команда)
	Если Не Команда = Неопределено Тогда //если запуск программный, вопросов не задаем
		ТекстВопроса = "Подтвердите обновление годового бюджета";
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена) = КодВозвратаДиалога.Отмена тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ОбновитьГодовойБюджетС();
КонецПроцедуры

&НаСервере
Процедура ОбновитьГодовойБюджетС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БюджетМесяц.Ссылка,
	|	БюджетМесяц.ГодовойБюджет,
	|	БюджетМесяц.Дата
	|ИЗ
	|	Документ.БюджетМесяц КАК БюджетМесяц
	|ГДЕ
	|	НЕ БюджетМесяц.ТолькоПросмотр
	|
	|УПОРЯДОЧИТЬ ПО
	|	БюджетМесяц.Дата";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ГодовойБюджет) Тогда
			Продолжить;
		КонецЕсли;
		
		
		ДеревоБДРФорма = Новый ДеревоЗначений;
		ДеревоБДРФорма.Колонки.Добавить("СтатьяДР");
		ДеревоБДРФорма.Колонки.Добавить("ПриходРасход");
		ДеревоБДРФорма.Колонки.Добавить("ЭтоГруппа");
		Для сч = 1 по 32 Цикл
			ДеревоБДРФорма.Колонки.Добавить("План"+сч);
			ДеревоБДРФорма.Колонки.Добавить("Факт"+сч);
		КонецЦикла;
		
		//заполняем месячный бюджет
		Документы.БюджетМесяц.ЗаполнитьСуществующийБюджет(Выборка.Ссылка, ДеревоБДРФорма);
		
		//из месячного бюджета заполняем годовой
		Период = Дата( СтрЗаменить(Год(Выборка.Дата), Символы.НПП, ""), Строка(Месяц(Выборка.Дата)), "1");
		Документы.БюджетМесяц.ОбновитьГодовойБюджетСМенеджер(Период, ДеревоБДРФорма, Выборка.ГодовойБюджет);

	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВсе(Команда)
	ТекстВопроса = "Обновить все бюджеты?";
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 60);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ОбновитьВсеПоПрогнозу(Неопределено);
	ОбновитьГодовойБюджет(Неопределено);
КонецПроцедуры

