///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИНТЕРАКТИВНОГО ОБНОВЛЕНИЯ ИНФОРМАЦИОННОЙ БАЗЫ 

// Проверить, есть ли необходимость выполнять обновление информационной базы, и
// если необходимо - выполняется обновление.
// Если обновление не удалось выполнить, то процедура предлагает завершить работу системы.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	Если НЕ СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().НеобходимоОбновлениеИнформационнойБазы Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Пожалуйста, подождите, выполняется обновление информационной базы...'"));
	ДокументОписаниеОбновлений = Неопределено;
	
	Попытка
		ВыполненныеОбработчикиОбновления = ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы();
		
		//прог 24 06 11
		
		//ЕстьДанные = ОбщийМодуль1Сервер.ЕстьДанныеВРегистреВерсииПодсистем();
		//
		////пусто
		//Если ЕстьДанные = Ложь Тогда
		//	НаборЗаписей = РегистрыСведений.ВерсииПодсистем.СоздатьНаборЗаписей();
		//	НоваяЗапись = НаборЗаписей.Добавить();
		//	НоваяЗапись.ИмяПодсистемы = "Планирование";
		//	НоваяЗапись.Версия = Метаданные.Версия;
		//	НаборЗаписей.Записать();
		//	
		//	Обработки.ПервоначальноеЗаполнение.ПолучитьФорму("Форма").Открыть();
		//КонецЕсли;
		
	Исключение
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
		    "ru = 'При обновлении информационной базы возникла ошибка:
			|
			|%1
			|
			|Подробности см. в Журнале регистрации.'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ТекстСообщенияОбОшибке;
	КонецПопытки;
	
	Состояние(НСтр("ru = 'Обновление информационной базы выполнено успешно.'"));
		
	Если ВыполненныеОбработчикиОбновления <> Неопределено Тогда	
		ОбновитьИнтерфейс();
	КонецЕсли;
	Если ВыполненныеОбработчикиОбновления <> "" Тогда	
		ОткрытьФорму("ОбщаяФорма.ОписаниеИзмененийСистемы", 
			Новый Структура("ВыполненныеОбработчикиОбновления", ВыполненныеОбработчикиОбновления));
	КонецЕсли;
	
КонецПроцедуры

// Проверить, возможно ли выполнять обновление информационной базы.
//
Функция ВозможноВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	Результат = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаЗаблокированаДляОбновления;
	
	Если Результат Тогда
		Сообщение = НСтр("ru = 'Информационная база заблокирована в связи с обновлением версии конфигурации. Работа системы будет завершена.
		                       |Обратитесь к системному администратору за подробностями.'");
		Предупреждение(Сообщение);
	КонецЕсли;
	
	Возврат НЕ Результат;
	
КонецФункции
