
Функция ИмяМесяцаПоНомеру(НомерМесяца) Экспорт
	Возврат НРег(Формат(ДобавитьМесяц('19700101', НомерМесяца-1), "ДФ=MMMM"));
КонецФункции

Функция НомерМесяцаПоИмени(ИмяМесяца) Экспорт
    ИмяМесяца = НРег(ИмяМесяца);
	Если ИмяМесяца = "январь" Тогда
		Возврат 1;
	ИначеЕсли ИмяМесяца = "февраль" Тогда
		Возврат 2;
	ИначеЕсли ИмяМесяца = "март" Тогда
		Возврат 3;
	ИначеЕсли ИмяМесяца = "апрель" Тогда
		Возврат 4;
	ИначеЕсли ИмяМесяца = "май" Тогда
		Возврат 5;
	ИначеЕсли ИмяМесяца = "июнь" Тогда
		Возврат 6;
	ИначеЕсли ИмяМесяца = "июль" Тогда
		Возврат 7;
	ИначеЕсли ИмяМесяца = "август" Тогда
		Возврат 8;
	ИначеЕсли ИмяМесяца = "сентябрь" Тогда
		Возврат 9;
	ИначеЕсли ИмяМесяца = "октябрь" Тогда
		Возврат 10;
	ИначеЕсли ИмяМесяца = "ноябрь" Тогда
		Возврат 11;
	ИначеЕсли ИмяМесяца = "декабрь" Тогда
		Возврат 12;
	Иначе
		Возврат "";
	КонецЕсли;	

КонецФункции

Процедура ПаузаСтарая(Секунды) Экспорт
	КомандаСистемы("Ping 127.0.0.1 -n "+Секунды);
КонецПроцедуры

Процедура Пауза(Секунды) Экспорт
	Попытка           //чтобы не только на windows работало
		Для к=1 По Секунды Цикл
			ПолучитьCOMОбъект("winmgmts:").ExecNotificationQuery("Select * from __instancemodificationevent where TargetInstance isa 'Win32_UTCTime'").NextEvent();
		КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры


//очищает план 
Процедура ОчиститьДеревоБДРПланРекурсивноКлиент(СтрокиДереваФормы, ПервыйМесяц = 1, ПоследнийМесяц = 13) Экспорт
	
	Для Каждого Стр Из СтрокиДереваФормы Цикл
		
		Если ТипЗнч(Стр.СтатьяДР) = Тип("Строка") Тогда //это строки НачОст и КонОст
			Продолжить;
		КонецЕсли;
		
		Для сч = ПервыйМесяц по ПоследнийМесяц Цикл
			Стр["План"+Строка(сч)] = 0;
			Попытка//нужна для очистки плана на месяц, там нет этой колонки
				Стр["Рез"+Строка(сч)] = 0;
			Исключение
			КонецПопытки;
		КонецЦикла;
			
		ОчиститьДеревоБДРПланРекурсивноКлиент(Стр.ПолучитьЭлементы(), ПервыйМесяц, ПоследнийМесяц);
	КонецЦикла;
	
 КонецПроцедуры