#Если Клиент Тогда

//////////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ МОДУЛЯ

#КонецЕсли

#Если Сервер Тогда

//////////////////////////////////////////////////////////////////////////////////
//// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА СЕРВЕРЕ)


//////////////////////////////////////////////////////////////////////////////////
//// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА СЕРВЕРЕ БЕЗ КОНТЕКСТА)

#КонецЕсли

#Если Клиент Тогда

//////////////////////////////////////////////////////////////////////////////////
//// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА КЛИЕНТЕ)

	
//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

//поместить введенные данные в таб часть документа перед закрытием формы
&НаКлиенте
Процедура Сохранить(Команда)
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоДеятельности",НачалоДеятельности);
	СтруктураПараметров.Вставить("ОкончаниеДеятельности",ОкончаниеДеятельности);
	СтруктураПараметров.Вставить("Организация",Организация);
	СтруктураПараметров.Вставить("Должность",Должность);
	СтруктураПараметров.Вставить("Обязанности",Обязанности);
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезСохранения(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецЕсли

#Если Сервер Тогда

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ СЕРВЕР

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоДеятельности = Параметры.НачалоДеятельности;
	ОкончаниеДеятельности = Параметры.ОкончаниеДеятельности;
	Организация = Параметры.Организация;
	Должность = Параметры.Должность;
	Обязанности = Параметры.Обязанности;
	СфераДеятельностиОрганизации = Параметры.СфераДеятельностиОрганизации;	
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ КЛИЕНТ


//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ШАПКИ


//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ <   >


////ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

#КонецЕсли