#Если Сервер Тогда
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Элементы.декСтатьяДР.Заголовок = Строка(Параметры.СтатьяДР);
	НайденныеСтроки = Параметры.Детализация.НайтиСтроки(Новый Структура("СтатьяДР,Период", Параметры.СтатьяДР, Параметры.Период));
	ТабДеталФорма = ДанныеФормыВЗначение(ТабДетал,Тип("ТаблицаЗначений"));	
	Для Каждого Стр из НайденныеСтроки Цикл
		НовСтр 				= ТабДеталФорма.Добавить();
		НовСтр.Комментарий 	= Стр.Комментарий;
		НовСтр.Сумма 		= Стр.Сумма;
	КонецЦикла;
	
	ВремИтогПодвал=ТабДетал.Итог("Сумма");
	
	ЗначениеВДанныеФормы(ТабДеталФорма, ТабДетал);
	
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда

&НаКлиенте
Процедура Сохранить(Команда)
	ЭтаФорма.Закрыть(ТабДетал);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезСохранения(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТабДеталиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования Тогда
		ВремИтогПодвал=ТабДетал.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДеталиПослеУдаления(Элемент)
	ВремИтогПодвал=ТабДетал.Итог("Сумма");
КонецПроцедуры

#КонецЕсли
