&НаСервере
Функция СформироватьОтчетСервер(ТекстОшибки =  "")
	
	Для Каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Эл) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Эл.Параметр = Новый ПараметрКомпоновкиДанных("Вариант") Тогда
			
			Если НЕ ЗначениеЗаполнено(Эл.Значение) Тогда
				ТекстОшибки = "Необходимо выбрать вариант бюджета!";	
				Возврат Ложь;
			КонецЕсли;
			
			Эл.Использование = Истина;
			
			Эл2 = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Вариант");
			Эл2.Значение = Эл.Значение;
			Эл2.Использование = Истина;
			
		ИначеЕсли Эл.Параметр = Новый ПараметрКомпоновкиДанных("Вариант2") Тогда
			
			Если НЕ ЗначениеЗаполнено(Эл.Значение) Тогда
				ТекстОшибки = "Необходимо выбрать вариант бюджета для сравнения!";	
				Возврат Ложь;
			КонецЕсли;
			
			Эл.Использование = Истина;
			
			Эл2 = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Вариант2");
			Эл2.Значение = Эл.Значение;
			Эл2.Использование = Истина;
			
		//ИначеЕсли Эл.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
		//	
		//	Эл2 = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
		//	
		//	Если НЕ ЗначениеЗаполнено(Эл.Значение) Тогда //период не указан, берем из варианта
		//		
		//		Эл2.Значение.ДатаНачала = НачалоГода(ТекущаяДата());
		//		Эл2.Значение.ДатаОкончания = КонецГода(ТекущаяДата());
		//		
		//	Иначе
		//		//период указан
		//		Эл2.Значение.ДатаНачала = Эл.Значение.ДатаНачала;
		//		Эл2.Значение.ДатаОкончания = Эл.Значение.ДатаОкончания;
		//		
		//	КонецЕсли;
		//	
		//	Эл2.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;

	
	//вывод отчета
	СкомпоноватьРезультат();	
	
	Результат.ПоказатьУровеньГруппировокСтрок(1);
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура ВыполнитьОтчет(Команда)
	ТекстОшибки = "";
	Рез = СформироватьОтчетСервер(ТекстОшибки);
	Если НЕ Рез Тогда
		Предупреждение(ТекстОшибки, 120);
	КонецЕсли;
КонецПроцедуры