
//выбор по кнопке ОК - выбирается текущая строка списка
&НаКлиенте
Процедура Сохранить(Команда)
	ЭтаФорма.Закрыть(Элементы.СписокМесяцев.ТекущиеДанные.Значение);
КонецПроцедуры

//отмена выбора
&НаКлиенте
Процедура ЗакрытьБезСохранения(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

//заполняет список месяцев
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Эл Из Параметры.СписокМесяцев Цикл
		СписокМесяцев.Добавить(Эл.Значение);
	КонецЦикла;	
КонецПроцедуры

//выбор по дабл-клику на списке
&НаКлиенте
Процедура СписокМесяцевВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Сохранить(Неопределено);
	Возврат;
КонецПроцедуры

