
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДатаЗапрета = Константы.ДатаЗапретаРедактирования.Получить();
	Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
		Если Дата <= ДатаЗапрета Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// регистр БДР 
	Если ЗначениеЗаполнено(СтатьяДР) Тогда
		ОбщийМодуль1Сервер.ДвижениеБДРФакт(
			Движения.БДР, 
			СтатьяДР, 
			ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Сумма, Валюта, Курс, Кратность), 
			Дата, 
			Кошелек,,,
			ЭтоПрогноз);
			
			Если ЗначениеЗаполнено(СтатьяДРГашение) Тогда
				ОбщийМодуль1Сервер.ДвижениеБДРФакт(
				Движения.БДР, 
				СтатьяДРГашение, 
				ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Сумма, Валюта, Курс, Кратность), 
				Дата, 
				Кошелек,,,
				ЭтоПрогноз);
				
			КонецЕсли;			
	КонецЕсли;
	
	// регистр ДенежныеСредства Приход
	ОбщийМодуль1Сервер.ДвижениеДенежныхСредств(
					Движения.ДенежныеСредства, 
					ВидДвиженияНакопления.Приход, 
					Дата, 
					Кошелек, 
					Сумма, Валюта, Курс, Кратность, ЭтоПрогноз);
					
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	//НеРегистрироватьВПланеОбмена = Неопределено;
	//ДополнительныеСвойства.Свойство("НеРегистрироватьВПланеОбмена", НеРегистрироватьВПланеОбмена);
	//Если НеРегистрироватьВПланеОбмена <> Истина Тогда //только сравнение с истиной!
	//	Узел = ПланыОбмена.ОбменСAndroid.НайтиПоКоду("02");
	//	Если Узел <> ПланыОбмена.ОбменСAndroid.ПустаяСсылка() Тогда
	//		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
	//	КонецЕсли;
	//КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого Движение Из Движения Цикл
		Движение.Очистить();
		Движение.Записать();
	КонецЦикла;
КонецПроцедуры

